# Tutorial-2: Basic Data Cleaning in Pandas
### Import pandas library

In [799]:
import pandas as pd

In [800]:
### Creating a dataframe
dict={'Column1':[23,34,None,23,78],  #Note entering of a missing value
     'Column2':[12,31,35,67,89],
     'Column3':[14,43,95,24,76],
     'Column4':[34,67,35,65,78]}
df=pd.DataFrame(dict,columns=['Column1','Column2','Column3','Column4'])

In [801]:
df

   Column1  Column2  Column3  Column4
0     23.0       12       14       34
1     34.0       31       43       67
2      NaN       35       95       35
3     23.0       67       24       65
4     78.0       89       76       78

In [802]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  4 non-null      float64
 1   Column2  5 non-null      int64
 2   Column3  5 non-null      int64
 3   Column4  5 non-null      int64
dtypes: float64(1), int64(3)
memory usage: 288.0 bytes

In [803]:
df.shape

(5, 4)

In [804]:
len(df.index)  #Counts the number of rows

5

In [805]:
# List of column names:
list(df.columns)

['Column1', 'Column2', 'Column3', 'Column4']

In [806]:
# or
df.columns

Index(['Column1', 'Column2', 'Column3', 'Column4'], dtype='object')

## Renaming columns

#### Selective change of column names

In [807]:
df = df.rename(columns={'Column1':'ABC', 'Column2':'EFG'}) 
df

    ABC  EFG  Column3  Column4
0  23.0   12       14       34
1  34.0   31       43       67
2   NaN   35       95       35
3  23.0   67       24       65
4  78.0   89       76       78

### Renaming all columns

In [808]:
df.columns = [1,2,3,4] 
df

      1   2   3   4
0  23.0  12  14  34
1  34.0  31  43  67
2   NaN  35  95  35
3  23.0  67  24  65
4  78.0  89  76  78

In [809]:
# Mass renaming of columns
df.rename(columns=lambda x: x + 10)

     11  12  13  14
0  23.0  12  14  34
1  34.0  31  43  67
2   NaN  35  95  35
3  23.0  67  24  65
4  78.0  89  76  78

In [810]:
# Mass renaming of index
df.rename(index=lambda x: x + 5)

      1   2   3   4
5  23.0  12  14  34
6  34.0  31  43  67
7   NaN  35  95  35
8  23.0  67  24  65
9  78.0  89  76  78

## Dropping Columns
If you drop columns without assigning it to df again, the changes will not show:

In [811]:
df.drop(columns=[3])
df

      1   2   3   4
0  23.0  12  14  34
1  34.0  31  43  67
2   NaN  35  95  35
3  23.0  67  24  65
4  78.0  89  76  78

But if you assign it to df, the changes will save:

In [812]:
df = df.drop(columns=[3])
df

      1   2   4
0  23.0  12  34
1  34.0  31  67
2   NaN  35  35
3  23.0  67  65
4  78.0  89  78

In [813]:
df.head(2) # Prints first 2 rows of the DataFrame

      1   2   4
0  23.0  12  34
1  34.0  31  67

In [814]:
df.tail(2) # Prints last 2 rows of the DataFrame

      1   2   4
3  23.0  67  65
4  78.0  89  78

In [815]:
df.describe() # Summary statistics for numerical columns

               1          2          4
count   4.000000   5.000000   5.000000
mean   39.500000  46.800000  55.800000
std    26.185238  30.776614  20.067386
min    23.000000  12.000000  34.000000
25%    23.000000  31.000000  35.000000
50%    28.500000  35.000000  65.000000
75%    45.000000  67.000000  67.000000
max    78.000000  89.000000  78.000000

In [816]:
df.describe().transpose() # Summary statistics for numerical columns

   count  mean        std   min   25%   50%   75%   max
1    4.0  39.5  26.185238  23.0  23.0  28.5  45.0  78.0
2    5.0  46.8  30.776614  12.0  31.0  35.0  67.0  89.0
4    5.0  55.8  20.067386  34.0  35.0  65.0  67.0  78.0

In [817]:
# Unique values counts for all columns
df.apply(pd.Series.value_counts)

        1    2    4
12.0  NaN  1.0  NaN
23.0  2.0  NaN  NaN
31.0  NaN  1.0  NaN
34.0  1.0  NaN  1.0
35.0  NaN  1.0  1.0
65.0  NaN  NaN  1.0
67.0  NaN  1.0  1.0
78.0  1.0  NaN  1.0
89.0  NaN  1.0  NaN

In [818]:
df.mean() # Mean of all columns

1    39.5
2    46.8
4    55.8
dtype: float64

In [819]:
df.corr() # Correlation between columns in a DataFrame

          1         2         4
1  1.000000  0.716036  0.674722
2  0.716036  1.000000  0.789257
4  0.674722  0.789257  1.000000

In [820]:
# Number of non-null values in each DataFrame column
df.count()

1    4
2    5
4    5
dtype: int64

In [821]:
df.max() # Highest value in each column

1    78.0
2    89.0
4    78.0
dtype: float64

In [822]:
df.min() # Lowest value in each column

1    23.0
2    12.0
4    34.0
dtype: float64

In [823]:
df.median() # Median of each column

1    28.5
2    35.0
4    65.0
dtype: float64

In [824]:
df.std() # Standard deviation of each column

1    26.185238
2    30.776614
4    20.067386
dtype: float64

In [834]:
df.sort_values(by=2) # Sort values by column name

      1   2   4
0  23.0  12  34
1  34.0  31  67
4  78.0  89  78

## Dupplicates

### Duplicate columns

Check to see if  our dataframe have any duplicate columns

In [825]:
df.columns.duplicated()

array([False, False, False])

As long as we have a duplicate column name, it will return True, even if the values differ.

### Duplicate rows

Delete duplicate rows with duplicate entry on a particular column based on the lowest value in another column:

e.g. The code below sorts values on column 2 (ascending) and drops duplicates on column 1. This way the duplicate with lowest number on column 2 will stay in dataframe.

In [826]:
df = df.sort_values(2, ascending=True).drop_duplicates(1).sort_index()
df

      1   2   4
0  23.0  12  34
1  34.0  31  67
2   NaN  35  35
4  78.0  89  78

### Missing Values
#### Check to see if there is any missing values:

In [827]:
print (df.isnull().values.any())

True

In [828]:
df.isnull() # Checks for null Values, Returns Boolean Array

       1      2      4
0  False  False  False
1  False  False  False
2   True  False  False
4  False  False  False

In [829]:
# Checking for not null values:
df.notnull()

       1     2     4
0   True  True  True
1   True  True  True
2  False  True  True
4   True  True  True

#### If a column has missing data, this is how to filter out or drop the missing values:

In [830]:
df = df[df[1].notnull()]  #filters out n/a from a certain column
df

      1   2   4
0  23.0  12  34
1  34.0  31  67
4  78.0  89  78

#### Drop all rows with missing values

In [831]:
df.dropna() # Drops all rows that contain null values

      1   2   4
0  23.0  12  34
1  34.0  31  67
4  78.0  89  78

#### Drops all columns that contain null values

In [833]:
df.dropna(axis=1)

      1   2   4
0  23.0  12  34
1  34.0  31  67
4  78.0  89  78

This result is similar to previous output because we already dropped the row with Null value.

#### Drops all columns have have less than n non null values

In [ ]:
df.dropna(axis=1,thresh=n)

#### Counting the number of missing values in each column:

In [ ]:
missing_cols = df.isnull().sum()
missing_cols = df[missing_cols > 0].index

temp = pd.DataFrame(df[missing_cols].isnull().sum()).reset_index()
temp.columns = ["Column Name", "Number Missing"]

print (temp)

## Replacing values with other values

In [ ]:
# Replaces all null values with x
df.fillna(x) 

# Replaces all null values with the mean (mean can be replaced with almost any function from the statistics section)
s.fillna(s.mean()) 

# Converts the datatype of the series to float
s.astype(float) 

# Replaces all values equal to 1 with 'one'
s.replace(1,'one') 

# Replaces all 1 with 'one' and 3 with 'three'
s.replace([1,3],['one','three']) 

# Changes the index column
df.set_index('column_one')

## White Spaces

### Trim whitespaces from strings across dataframe using this function:

In [ ]:
def trim_white_spaces(df):
    trim_strings = lambda x: x.strip() if isinstance(x, str) else x
    return df.applymap(trim_strings)
df = trim_white_spaces(df)

# Applying functions

In [835]:
f= lambda x:x*10  #f(x)=x*10
df.apply(f)

       1    2    4
0  230.0  120  340
1  340.0  310  670
4  780.0  890  780